FULL/rails/app/app/controllers/tournaments_controller.rb

    def set_tournament
      @tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2