Light/rails/app/app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."position_general" != $1) ORDER BY "users"."position_general" ASC  [["position_general", -1]]
SELECT "users".* FROM "users" WHERE ("users"."position_free" != $1) ORDER BY "users"."position_free" ASC  [["position_free", -1]]
SELECT "users".* FROM "users" WHERE ("users"."position_tournament" != $1) ORDER BY "users"."position_tournament" ASC  [["position_tournament", -1]]
---
  def index
    @users_general = User.all.where.not(position_general: -1).order(:position_general)
    @users_free = User.all.where.not(position_free: -1).order(:position_free)
    @users_tournament = User.all.where.not(position_tournament: -1).order(:position_tournament)